[{"title":"Control项目及Apk文件下载地址","date":"2017-06-06T03:19:29.000Z","path":"2017/06/06/jishu-03/","text":"##课表导入和专注模式还在开发中，感谢支持。Control下载链接","comments":true,"tags":[{"name":"技术 Android开发","slug":"技术-Android开发","permalink":"http://www.majunsong.com/tags/技术-Android开发/"}]},{"title":"新手在Android开发中的各种坑","date":"2017-06-05T18:55:18.000Z","path":"2017/06/06/jishu-02/","text":"（全都是我一脚一坑踩出来的血泪史啊。。。） ##ecllipse的安装篇 ##Android基础篇 ##GitHub开源项目导入篇 ###（坑先挖着 考试周过后再填）","comments":true,"tags":[{"name":"技术 Android开发","slug":"技术-Android开发","permalink":"http://www.majunsong.com/tags/技术-Android开发/"}]},{"title":"C++中的const小结","date":"2017-04-05T08:29:18.000Z","path":"2017/04/05/jishu-01/","text":"在C++中，常用const来代替#define定义常量，但其应用并不仅仅局限于此。这里将总结一下C++中const的其它几种使用情况，以及其作用和原理。 const和指针指针 C++中的指针与C中的概念相同（即一特殊变量，用于存放所指向变量的地址），需注意的是在C++中常用“引用”来简化指针操作。 指向常量的指针 const char *p=s;在 常指针指向常量的常指针const和函数const修饰函数返回值常函数const和拷贝构造函数####（坑先挖着 考试周过后再填）","comments":true,"tags":[{"name":"技术 C++","slug":"技术-C","permalink":"http://www.majunsong.com/tags/技术-C/"}]},{"title":"一段对时间的告白","date":"2017-03-08T13:00:22.000Z","path":"2017/03/08/sui 3/","text":"————《Boyhood》观后感对于习惯“快餐文学”的大多数人来讲，坚持把这两小时的电影看完无异于精神折磨。 你大可以将这部电影视作记录一个底层家庭中各种琐碎的流水账，或者用导演的话来讲，这就是一部“家庭生活纪录片”。 ————一个饱受生活变故的美国家庭平淡地经历着平淡地一切：一次次搬家与重组，再一次次破碎与分别。没有大场面，没有大制作；没有无厘头，没有黑科技；没有超人，也没有异形。 若不是那个“一部拍摄了12年的电影”这个“唬人”的噱头，我想甚至都不会有人听说这部电影。不过我更希望你将这部电影看作一段对时间真挚而又深沉的告白。 12年的时光，孩子们由懵懂和淘气到叛逆再到成熟，生父虽痞里痞气但言语与歌声中处处充满生活哲学，母亲即使被生活重担所束缚也不愿放弃在大学里的理想。电影以小梅森仰望天空思考为开端，再以梅森和大学同学关于时间的探讨为结尾。然后，当一切戛然而止时，你会发现，每一个角色都用自己的行动，演绎了一段自己对时光的告白。 主角梅森十多年的人生眨眼而逝，就像片中所说的“仿佛时间在眼前展开一样”。甚至当你上一刻还在因梅森那掩埋死去小鸟时的眼神而感到心痛时，下一刻却发现他已经蓄起了长发甚至戴上了耳钉。 这部电影或许不过记录了一个男孩从童年到成人的一组组生活片段：跟伙伴玩耍，跟姐姐争吵，沉迷游戏和摄影，蓄起长发打上耳钉，自力更生的打工，陷入恋爱再失恋…那么琐碎，但却又紧紧抓着那些个人化的普遍细节和情感流动，一帧帧的呈现在眼前，那些光影里的温暖和黯然可以一路穿过眼前的映面，直入人们心里，没一个镜头在追溯着过去，却无一不刻不把时空倒错。 而梅森的母亲其实也一直跟着母亲一直成长，并且爱一直贯穿始终。从年轻时跟人争吵“Don’t call my chidren mistakes!”，到后来带着孩子去读硕士。而特别是在最后，在那个狭小的公寓里，当梅森即将离家远行时，母亲那突然的崩溃，直戳人心：————“My life is just gonna go like this ！ Getting married.Having kids.Getting divorced.Getting my master’s degree.Sending you off to college. You know what is next? It’s my fukin’funeral!分别的痛苦让母亲几近崩溃，这成长阵痛和苦涩总不是梅森一个人在承担，不管酸甜苦辣，时间就安安静静的守在哪里。 在梅森成人礼上，生父再次为他的儿女们作了一首歌。 ——I want for us to be together forever. ——But to wander where I may. ——I want you to be easy and casual. ——But sill demand I stay. ——I want you to know me completely, ——but still remain mysterious. ——Consider everythying seeply, ——but still remain fearless。 ——Climb to the top Look over the ledge ——Dance barefoot on the razor’s edge. ——If I don’t try I’ll never fail. （我要我们能永远在一起。 但跟我一起漫游 我要你能轻松暇逸。 但仍需要我留下 我要你能完全了解我。 但仍保持神秘 凡事深思熟虑，但仍无所畏惧 爬到山顶 俯瞰岩壁 赤脚在刀锋上舞蹈 如若不试，便永远无法失败） 梅森生父对梅森姐弟的爱几乎都融化在他为他们所写的每一首歌里。或许梅森生父曾经不务正业，不过游手好闲的业余歌手。但当时光让他沉淀下来时，无论是那充满脏话的教诲还是那独特的人生哲学，他对梅森姐弟的一切都显得那么温柔如水。 整部电影或许就是这个家庭的，一段关于时间的告白。男孩的生活仍将在大学继续，他的前方还有更多的人，更多的事物等着他他去经历去感受。而这部电影带给我们的，除了对自己那段少年时光的感怀，或许还有些许对时间与人生的思考。十二年何其短暂，一场两小时的电影便能将其全部囊括。与其去追逐时间本身，不如将更多精力放在更多自己所热爱的事情上。 最后，梅森片尾的一段对话作结尾：——Everyone always saying “Seize the moment”, I’m thinking it’s the other way around, the moment seizes us.——Yeah, the moment is just always right now.（————每个人都在说“要抓住时间”，但我觉得相反，是“时间抓住我们”。 ————对，时间永远都在。）","comments":true,"tags":[{"name":"随笔 影评","slug":"随笔-影评","permalink":"http://www.majunsong.com/tags/随笔-影评/"}]},{"title":"当孤独与叛逆相遇——《这个杀手不太冷》观后感","date":"2017-02-19T08:48:55.000Z","path":"2017/02/19/sui 1/","text":"今天有幸看了这部94年的电影–《这个杀手不太冷》，之前经常听到周围人提及这部电影，而在之前英语课的配音表演上也曾有同学把其中的片段用作素材，所以兴趣更甚。 两盒牛奶，偶尔一场冷门电影，这边是他日常生活的一切；一盆盆栽，一箱武器，这边是他所拥有的一切————至少在遇到那个叛逆而又可伶的小女孩之前是这样的。孤独充斥着他的生活，然而他却乐在其中，甚至企图杀死那个冒然闯入的女孩。整部电影用两代人，两种不同性格的人，两个看似完全不相关联的人的冲突来展开了整部电影。从刚开始的矛盾与状况到后来的温情甚至*，不过幸好编剧没有以大团圆结局收尾（讲真，如果知道12岁小女孩与42岁大叔以爱情线来继续往下展开的话，没人会受得了的，哪怕只是观众的想象）。 他们之前或许算不得亲情，更没法以爱情来定义，他们之间或许只不过是一个无依无靠的叛逆少女与毫无牵挂的“冷血杀手”之间的相互慰藉，互舐伤口的关系而已。因为天下总有不少命运坎坷的可伶人,若是相遇，他们必将用自己的一切去珍惜 最后，以他们的某段对话作结： ——生活是否永远艰辛，还是仅仅童年是这样？ ——总是如此。","comments":true,"tags":[{"name":"随笔 影评","slug":"随笔-影评","permalink":"http://www.majunsong.com/tags/随笔-影评/"}]},{"title":"自律与毅力是改变的必备","date":"2017-02-19T06:47:28.000Z","path":"2017/02/19/sui 2/","text":"——2016秋季学期总结如果用一个词来形容我这一学期（2016.8.19-2017.1.6）的状态的话，“懈怠”最适合不过。在八月份的时候，我怀着对大学美好生活的憧憬，踌躇满志开始了我的大学生活。但军训之后我每天的上课状态却让我失望之至。由于暑假已经习惯了每天迟于零点睡觉（甚至更晚，毕竟第二天可以起得很迟而不会对生活产生太大影响），导致第二天早上上课时精神状态极其糟糕，从而使自己的课余生活总是在自我埋怨与补习上课知识中度过，因此总是没能及时预习，导致又一天的荒废，从而形成了一个“上课没有效率，课后熬夜补习，第二天上课没有效率”的恶性循环，并且令人十分无语的是哪怕自己学得再累，这种方法永远无法带来与所付出的努力相匹配的成功。 世界上最悲哀的事情，就是你付出了你所认为的最大的努力，却连50%的期望都无法达到。 另一个导致自己出现“懈怠”的原因，便是自己对于时间的重要性的忽视，以及时间利用率的低下。 虽然有“成功的80%来自于所花时间的20%”这种说法，但说不定你现在的时间，就决定了未来某次成功的80%呢？ 时间的重要性倒没必要多说了，问题确是在生活中我们确常常将其无意识地忽视。 对于需要完成的任何事情，只要当下有空，或者脑海里有“玩玩手机吧”这种想法时，都应立即将事情完成后再考虑娱乐，这反映的是一个人对事情的态度，只有时刻保有对所出现问题的积极解决的态度，而不是将其搁置去做那些让当下的自己“最爽的事情”（从生物学上来讲，这是遗传自我们祖先的“趋利避害”特性，人总是趋向于去能满足让当下的自己的事情，这在于那个茹毛饮血的年代无疑是十分重要的，然而在快节奏与高压的现代，却是致命的），才让自己过得充实而又能有所收获。确立一个清晰的目标并在生活中保持自律无疑也是也是很好的方法。 而对于时间的利用率，个人认为精神状态是很关键的。 换句话讲，对于手头的事情应该有一种对它感兴趣的，兴奋的状态（哪怕是假装的）。在这种状态下做事情无疑能达到事半功倍的效果，有时甚至还能取得意料之外的收获。 成功的秘密就是欲望、努力、钻研、决心和坚持…而这些都需要毅力与自律能力 （《时间管理》吉姆·兰德尔）， 而“懈怠”无疑却是“毅力”与“自律”的反义词（这样来看的话它应该是所有正面积极词语的反义词，amazing）,他就像那辆载着人南辕北辙的车，让一切流经你身边的时间都失去意义。 或者短时间来讲并不会产生多少坏处，而且对于所应该做的事情的“懈怠”的态度反而令自己有更多的时间去娱乐去发呆。但这不是早已不是那个茹毛饮血的年代，人仅仅去考虑当下的自己是否吃饱穿暖玩好是绝对不行的。就像刚过完寒假的你发现自己一个多月似乎什么都没有做一样，就像我我现在回顾我一整个秋季学期的心情一样。 对于已经发生的事情，我们所能做的只能是反思然后放下，哪怕里面充满了太多遗憾让人无法轻易释怀。","comments":true,"tags":[{"name":"随笔 反思","slug":"随笔-反思","permalink":"http://www.majunsong.com/tags/随笔-反思/"}]}]