[{"title":"当孤独与叛逆相遇——《这个杀手不太冷》观后感","date":"2017-02-19T08:48:55.000Z","path":"2017/02/19/sui 1/","text":"今天有幸看了这部94年的电影–《这个杀手不太冷》，之前经常听到周围人提及这部电影，而在之前英语课的配音表演上也曾有同学把其中的片段用作素材，所以兴趣更甚。 两盒牛奶，偶尔一场冷门电影，这边是他日常生活的一切；一盆盆栽，一箱武器，这边是他所拥有的一切————至少在遇到那个叛逆而又可伶的小女孩之前是这样的。孤独充斥着他的生活，然而他却乐在其中，甚至企图杀死那个冒然闯入的女孩。整部电影用两代人，两种不同性格的人，两个看似完全不相关联的人的冲突来展开了整部电影。从刚开始的矛盾与状况到后来的温情甚至*，不过幸好编剧没有以大团圆结局收尾（讲真，如果知道12岁小女孩与42岁大叔以爱情线来继续往下展开的话，没人会受得了的，哪怕只是观众的想象）。 他们之前或许算不得亲情，更没法以爱情来定义，他们之间或许只不过是一个无依无靠的叛逆少女与毫无牵挂的“冷血杀手”之间的相互慰藉，互舐伤口的关系而已。因为天下总有不少命运坎坷的可伶人,若是相遇，他们必将用自己的一切去珍惜 最后，以他们的某段对话作结： ——生活是否永远艰辛，还是仅仅童年是这样？ ——总是如此。","comments":true,"tags":[{"name":"影评 随笔","slug":"影评-随笔","permalink":"http://www.majunsong.com/tags/影评-随笔/"}]},{"title":"自律与毅力是改变的必备","date":"2017-02-19T06:47:28.000Z","path":"2017/02/19/sui 2/","text":"——2016秋季学期总结如果用一个词来形容我这一学期（2016.8.19-2017.1.6）的状态的话，“懈怠”最适合不过。在八月份的时候，我怀着对大学美好生活的憧憬，踌躇满志开始了我的大学生活。但军训之后我每天的上课状态却让我失望之至。由于暑假已经习惯了每天迟于零点睡觉（甚至更晚，毕竟第二天可以起得很迟而不会对生活产生太大影响），导致第二天早上上课时精神状态极其糟糕，从而使自己的课余生活总是在自我埋怨与补习上课知识中度过，因此总是没能及时预习，导致又一天的荒废，从而形成了一个“上课没有效率，课后熬夜补习，第二天上课没有效率”的恶性循环，并且令人十分无语的是哪怕自己学得再累，这种方法永远无法带来与所付出的努力相匹配的成功。 世界上最悲哀的事情，就是你付出了你所认为的最大的努力，却连50%的期望都无法达到。 另一个导致自己出现“懈怠”的原因，便是自己对于时间的重要性的忽视，以及时间利用率的低下。 虽然有“成功的80%来自于所花时间的20%”这种说法，但说不定你现在的时间，就决定了未来某次成功的80%呢？ 时间的重要性倒没必要多说了，问题确是在生活中我们确常常将其无意识地忽视。 对于需要完成的任何事情，只要当下有空，或者脑海里有“玩玩手机吧”这种想法时，都应立即将事情完成后再考虑娱乐，这反映的是一个人对事情的态度，只有时刻保有对所出现问题的积极解决的态度，而不是将其搁置去做那些让当下的自己“最爽的事情”（从生物学上来讲，这是遗传自我们祖先的“趋利避害”特性，人总是趋向于去能满足让当下的自己的事情，这在于那个茹毛饮血的年代无疑是十分重要的，然而在快节奏与高压的现代，却是致命的），才让自己过得充实而又能有所收获。确立一个清晰的目标并在生活中保持自律无疑也是也是很好的方法。 而对于时间的利用率，个人认为精神状态是很关键的。 换句话讲，对于手头的事情应该有一种对它感兴趣的，兴奋的状态（哪怕是假装的）。在这种状态下做事情无疑能达到事半功倍的效果，有时甚至还能取得意料之外的收获。 成功的秘密就是欲望、努力、钻研、决心和坚持…而这些都需要毅力与自律能力 （《时间管理》吉姆·兰德尔）， 而“懈怠”无疑却是“毅力”与“自律”的反义词（这样来看的话它应该是所有正面积极词语的反义词，amazing）,他就像那辆载着人南辕北辙的车，让一切流经你身边的时间都失去意义。 或者短时间来讲并不会产生多少坏处，而且对于所应该做的事情的“懈怠”的态度反而令自己有更多的时间去娱乐去发呆。但这不是早已不是那个茹毛饮血的年代，人仅仅去考虑当下的自己是否吃饱穿暖玩好是绝对不行的。就像刚过完寒假的你发现自己一个多月似乎什么都没有做一样，就像我我现在回顾我一整个秋季学期的心情一样。 对于已经发生的事情，我们所能做的只能是反思然后放下，哪怕里面充满了太多遗憾让人无法轻易释怀。","comments":true,"tags":[{"name":"反思 随笔","slug":"反思-随笔","permalink":"http://www.majunsong.com/tags/反思-随笔/"}]}]